#ifndef LNK_JUMP_LIST_PARSER_PARSERUTILS_H
#define LNK_JUMP_LIST_PARSER_PARSERUTILS_H

#include <string>
#include <iostream>
#include "ShellLinkAndJumpListHandler.h"

/**
    @class ParserUtils
    Вспомогательный класс, который предоставляет методы для взаимодействия с пользователем.*/
class ParserUtils {
private:
    /* ----------------------------------------------------------------------------------------------- */
    /*! Функиця позволяющая вывести названи приложения по указанному appId.
        @param appId Название файла в специальном виде appId.
        @return void                                                                                   */
    /* ----------------------------------------------------------------------------------------------- */
    static std::string getAppIdType(std::string appId);

public:
    /* ----------------------------------------------------------------------------------------------- */
    /*! Функиця для определения сможет ли программа работать с указанным файлом.
        @param filePath Путь до файла, в котором нужно разобрать структуры .lnk или список быстрого доступа.
        @return void                                                                                   */
    /* ----------------------------------------------------------------------------------------------- */
    static bool programCanParseFile(std::string filePath);
    /* ----------------------------------------------------------------------------------------------- */
    /*! Функиця начального взаимодействия с пользователем. Позволяет начать разбор файлов.
        @return void                                                                                   */
    /* ----------------------------------------------------------------------------------------------- */
    static void startParsing();

    /* ----------------------------------------------------------------------------------------------- */
    /*! \brief Структура appId_type содержит appId и соответствующее ему названия приложения.          */
    /*!  Включает следующие поля:
            appId;
            name;                                                                                      */
    /* ----------------------------------------------------------------------------------------------- */
    struct appId_type {
        std::string appId;
        std::string name;
    };
};

#endif //LNK_JUMP_LIST_PARSER_PARSERUTILS_H
